[
  {
    "title": "Our Reply to the Enquiry Regarded the Packaging Information Change of PetsBuddy® Goatsmilk Series Products",
    "description": "As we upgraded the formula of PetsBuddy® Goatsmilk series products, some information on their packaging has been changed accordingly.",
    "date": "Jan, 2021",
    "image": "img/blogs/blog69.jpg",
    "url": "post-69.html"
  },
  {
    "title": "Pet Owners Rank 'Animal Welfare' near 'No Artificial'",
    "description": "Feeding pets like people continues to drive pet food sales growth and innovation, David Sprinkle, publisher and research director of Packaged Facts said in his presentation at Petfood Forum CONNECT.",
    "date": "Dec, 2020",
    "image": "img/blogs/blog68.jpg",
    "url": "post-68.html"
  },
  {
    "title": "4 Aspects of Dog, Cat Food Protein Sustainability",
    "description": "Sustainable dog, cat and other pet food formulators can evaluate any protein source’s effects on human communities, livestock and the environment using a four-part framework developed by the Pet Sustainability Coalition.",
    "date": "Dec, 2020",
    "image": "img/blogs/blog67.jpg",
    "url": "post-67.html"
  },
  {
    "title": "Ingredient Substitution Adapts Pet Food to Disruption",
    "description": "Pet food ingredient supply chains can snap, or at least get tangled, for many reasons.",
    "date": "Nov, 2020",
    "image": "img/blogs/blog66.jpg",
    "url": "post-66.html"
  },
  {
    "title": "Lamb Kidney may be Palatable Sub for Liver in Cat Food",
    "description": "Raw lamb kidney may have palatability and nutritional advantages as a cat food ingredient over other co-products.",
    "date": "Nov, 2020",
    "image": "img/blogs/blog65.jpg",
    "url": "post-65.html"
  },
  {
    "title": "Owners Unaware of Potential Illness from Pet Food",
    "description": "A study led by Purdue University’s Yaohua “Betty” Feng, an assistant professor of food science",
    "date": "Oct, 2020",
    "image": "img/blogs/blog64.jpg",
    "url": "post-64.html"
  },
  {
    "title": "Premium Dog Food Related to More Greenhouse Gas Than Cat",
    "description": "According to one research team, greenhouse gas emissions associated with kibble production accounted for 1.1 to 2.9% of total agricultural emissions.",
    "date": "Oct, 2020",
    "image": "img/blogs/blog63.jpg",
    "url": "post-63.html"
  },
  {
    "title": "2 Trends Fuel Pet Food Facility Expansion in 2020",
    "description": "Despite the COVID-19 pandemic, pet food producers and ingredient suppliers expanded their operations in 2020 as the twin trends of premiumization and humanization drove demand.",
    "date": "Sep, 2020",
    "image": "img/blogs/blog62.jpg",
    "url": "post-62.html"
  },
  {
    "title": "Australia Feeds More Raw Pet Food",
    "description": "The cultural differences among pet owners in feeding practices may have changed over time.",
    "date": "Sep, 2020",
    "image": "img/blogs/blog61.jpg",
    "url": "post-61.html"
  },

  {
    "title": "The Global Pandemic Hasn’t Stopped Pet Spending",
    "description": "The global COVID-19 pandemic has brought consumer priorities into sharp focus, particularly as the illness continues to dominate the news, local and national government policy, and the way people are finding new patterns to conduct their days. ",
    "date": "Aug, 2020",
    "image": "img/blogs/blog60.jpg",
    "url": "post-60.html"
  },
  {
    "title": "Whey Protein’s Potential for Fitness, Life-stage Pet Food",
    "description": "Whey protein appears in many pet owners’ own diets, especially fitness-minded humans. Whey protein makes its way into energy bars, shakes, supplements, gels and baked goods. Pet food ingredient suppliers now produce whey protein.",
    "date": "Aug, 2020",
    "image": "img/blogs/blog59.jpg",
    "url": "post-59.html"
  },
  {
    "title": "Core Species of Dog, Cat Gut Microbiome Identified",
    "description": "A wide array of microbes dwell in the crevices of dogs’ and cats’ intestines, forming complex communities called the microbiome.",
    "date": "Jul, 2020",
    "image": "img/blogs/blog58.jpg",
    "url": "post-58.html"
  },
  {
    "title": "U.S. Pet Wwners not (yet) Decreasing Spending on Pet Food",
    "description": "A new report on the U.S. pet food market indicates few dog and cat owners are spending less on food for their pets – based on a survey conducted by Packaged Facts in April and May 2020. As the country struggles to contain escalating cases of COVID-19, unemployment and financial hardship are also increasing. That could eventually affect how much pet owners can spend.",
    "date": "Jul, 2020",
    "image": "img/blogs/blog57.jpg",
    "url": "post-57.html"
  },
  {
    "title": "Strategic Responses to Pandemic Challenges for Pet Food",
    "description": "Pet food supply chain during COVID-19",
    "date": "Jun, 2020",
    "image": "img/blogs/blog56.jpg",
    "url": "post-56.html"
  },
  {
    "title": "How the Global Pet Food Supply Chain, Retail are Changing",
    "description": "There’s nothing like a pandemic to highlight the globalization of the pet food market, along with the overall economy. ",
    "date": "Jun, 2020",
    "image": "img/blogs/blog55.jpg",
    "url": "post-55.html"
  },
  {
    "title": "Are You Confident in the Pet Food Market’s Resilience?",
    "description": "Baseline pet food confidence data",
    "date": "May, 2020",
    "image": "img/blogs/blog54.jpg",
    "url": "post-54.html"
  },
  {
    "title": "Global Transportation Challenges Reach Pet Food",
    "description": "The world is collectively experiencing nearly unprecedented supply chain challenges, and the pet food industry must meet them.",
    "date": "May, 2020",
    "image": "img/blogs/blog53.jpg",
    "url": "post-53.html"
  },
  {
    "title": "Will COVID-19 Surge in Pet Food, Other E-Commerce Last?",
    "description": "Well before the COVID-19 pandemic disrupted every aspect of life and business as we know them, e-commerce was enacting its own form of disruption, including in the pet food market.",
    "date": "Apr, 2020",
    "image": "img/blogs/blog52.jpg",
    "url": "post-52.html"
  },
  {
    "title": "Pandemic Challenges Global Pet Food Ingredient Suppliers",
    "description": "While movement restrictions may have hindered pet food ingredient production and delivery, one executive said his company managed to maintain on-time delivery despite lockdowns.",
    "date": "Apr, 2020",
    "image": "img/blogs/blog51.jpg",
    "url": "post-51.html"
  },
  {
    "title": "Internet Key to Pet Food Industry Changes Post-Pandemic",
    "description": "Two long-term changes to the pet food industry caused by the COVID-19 pandemic will depend on the internet.",
    "date": "Mar, 2020",
    "image": "img/blogs/blog50.jpg",
    "url": "post-50.html"
  },
  {
    "title": "Do Pet Food Brand Loyalty, Quality Apply in a Pandemic?",
    "description": "If a dog or cat seems healthy eating a particular food, and it fits the owner’s criteria and desires in terms of ingredients, price and other attributes, they tend to stick with it.",
    "date": "Mar, 2020",
    "image": "img/blogs/blog49.jpg",
    "url": "post-49.html"
  },
  {
    "title": "Soy Uncommon in Dog and Cat Foods",
    "description": "An analysis of Petfood Industry’s Dog and Cat Food Ingredient Center database explored how soy is used in pet foods.",
    "date": "Feb, 2020",
    "image": "img/blogs/blog48.jpg",
    "url": "post-48.html"
  },
  {
    "title": "Combination Feeding a Popular Option for Pet Parents",
    "description": "More pet food companies are providing everything from complementary products to specific advice on how to combine wet and dry food in pet diets.",
    "date": "Feb, 2020",
    "image": "img/blogs/blog47.jpg",
    "url": "post-47.html"
  },
  {
    "title": "When Humanization in Pet Food Goes Too Far",
    "description": "No one could argue with the fact that humanization has proven a huge boon to pet food.",
    "date": "Jan, 2020",
    "image": "img/blogs/blog46.jpg",
    "url": "post-46.html"
  },
  {
    "title": "Minerals are Crucial to Pet Food Product Differentiation",
    "description": "Minerals play a key role in a pet’s nutrition, as they should be available in the right amounts to provide a healthy and balanced diet.",
    "date": "Jan, 2020",
    "image": "img/blogs/blog45.jpg",
    "url": "post-45.html"
  },
  {
    "title": "3 Steps to Earning Skeptical Pet Owners’ Trust",
    "description": "Three steps can help a pet food company achieve dog, cat and other pet owners’ trust.",
    "date": "Dec, 2019",
    "image": "img/blogs/blog44.jpg",
    "url": "post-44.html"
  },
  {
    "title": "Cat People vs. Dog People: The Battle Continues",
    "description": "General Social Survey (GSS) released the second half of its 2018 survey results, which included pet ownership data.",
    "date": "Dec, 2019",
    "image": "img/blogs/blog43.jpg",
    "url": "post-43.html"
  },
  {
    "title": "Veterinarians and Pet Food: A Relationship in Progress",
    "description": "Pet owners continue to focus on their pets’ health via pet food, but veterinarians are not necessarily where consumers are going for advice.",
    "date": "Nov, 2019",
    "image": "img/blogs/blog42.jpg",
    "url": "post-42.html"
  },
  {
    "title": "Consumer Trust and The Pet Food Industry: Bridging The Gap",
    "description": "When adversity strikes, it’s time to come together and remember our shared vision: happy, healthy lives for pets and their families.",
    "date": "Nov, 2019",
    "image": "img/blogs/blog41.jpg",
    "url": "post-41.html"
  },
  {
    "title": "Hemp CBD Research Aims for Dog, Cat Dosage Data",
    "description": "New cannabidiol (CBD) pet products, during the past few years, greatly outpaced publication of peer-reviewed studies on how CBD dosage and other variables influence pet health. ",
    "date": "Oct, 2019",
    "image": "img/blogs/blog40.jpg",
    "url": "post-40.html"
  },
  {
    "title": "The Complexities of Sustainable Pet Food Packaging",
    "description": "Current recycling challenges. One of the most prominent challenges to creating a sustainable system within which packaging can be recycled.",
    "date": "Oct, 2019",
    "image": "img/blogs/blog39.jpg",
    "url": "post-39.html"
  },
  {
    "title": "Do Most Pets Eat Only a Complete and Balanced Pet Food?",
    "description": "Basic nutrition teaches that nutritional balance and fortification are critical in bone growth, muscle development and other metabolic functions.",
    "date": "Sep, 2019",
    "image": "img/blogs/blog38.jpg",
    "url": "post-38.html"
  },
  {
    "title": "FDA Warning That Dog Foods Formulated with High Percentages of Some Ingredients may Correlate to Increased Risk of a Certain Heart Disease.",
    "description": "FDA Warning That Dog Foods Formulated with High Percentages of Some Ingredients may Correlate to Increased Risk of a Certain Heart Disease.",
    "date": "Sep, 2019",
    "image": "img/blogs/blog37.jpg",
    "url": "post-37.html"
  },
  {
    "title": "2019，We are in Pet Fair Asia at Shanghai again",
    "description": "PetsBuddy® took part in the Pet Fari Asia again in August at Shanghai.",
    "date": "Aug, 2019",
    "image": "img/blogs/blog36-1.jpg",
    "url": "post-36.html"
  },
  {
    "title": "We Love Pets, We Are Here for Spoil Them",
    "description": "With ENVON PET SUPPLIES, the distributor for Sydney market, PetsBuddy® joined in one of the biggest pet shows in Australia—Sydney Dog Lover Show.",
    "date": "Aug, 2019",
    "image": "img/blogs/blog35-1.jpg",
    "url": "post-35.html"
  },
  {
    "title": "Taurine Supplementation may Reduce The Risk of Dogs Developing Dilated Cardiomyopathy",
    "description": "Dilated cardiomyopathy (DCM) is indeed a complex question, and scientists have few solid explanations.",
    "date": "Jul, 2019",
    "image": "img/blogs/blog34.jpg",
    "url": "post-34.html"
  },
  {
    "title": "Cat Care Program may Emphasize Lifestage Pet Food",
    "description": "Leading U.K.-.based cat charity International Cat Care (iCatCare) launched their ‘Cat Care for Life’ program at the 2018 British Small Animal Veterinary Association Congress (BSAVA).",
    "date": "Jul, 2019",
    "image": "img/blogs/blog33.jpg",
    "url": "post-33.html"
  },
  {
    "title": "Renewed Focus on Pet Food Packaging Sustainability?",
    "description": "So-called single-use plastics are currently a focus of consumer concerns and news headlines, and most plastic pet food packaging would fall into that category.",
    "date": "Jun, 2019",
    "image": "img/blogs/blog32.jpg",
    "url": "post-32.html"
  },
  {
    "title": "Crude Fiber Guarantees: Are They on Their Way Out?",
    "description": "A maximum percentage guarantee for crude fiber has been an integral part of the animal feed label for perhaps the past 100 years.",
    "date": "Jun, 2019",
    "image": "img/blogs/blog31.jpg",
    "url": "post-31.html"
  },
  {
    "title": "5 Tips for Dog, Cat Gut Health via Pet Food Ingredients",
    "description": "1. Hypoallergenic diets for identifying pet gut problems ...",
    "date": "May, 2019",
    "image": "img/blogs/blog30.jpg",
    "url": "post-30.html"
  },
  {
    "title": "Why Newer Pet Food Formats Like Freeze Dried are Rising",
    "description": "With humanization of pets the norm now, human food trends continue to significantly impact pet food product development and marketing strategy.",
    "date": "May, 2019",
    "image": "img/blogs/blog29.jpg",
    "url": "post-29.html"
  },
  {
    "title": "Online Pet Food Sales may Beat Other Channels by 2023",
    "description": "Pet food, treat and other product e-commerce may continue growing to become the dominant retail channel for pet products by 2023, continuing dramatic growth between 2015 and 2018.",
    "date": "Apr, 2019",
    "image": "img/blogs/blog28.jpg",
    "url": "post-28.html"
  },
  {
    "title": "3 Controversial Pet Food Ingredients Debated by AAFCO",
    "description": "Association of American Feed Control Officials (AAFCO) members debated the use of certain pet food ingredients in the deliberations of the Ingredient Definitions Committee during a meeting in January.",
    "date": "Apr, 2019",
    "image": "img/blogs/blog27.jpg",
    "url": "post-27.html"
  },
  {
    "title": "How to Feed Your Furry Friends Healthily - PetsBuddy®",
    "description": "Shares pet nutrition knowledge with Chinese pet owners in Beijing International Pet Expo 2019",
    "date": "Mar, 2019",
    "image": "img/blogs/blog26-1.jpg",
    "url": "post-26.html"
  },
  {
    "title": "3 Tips for Sales-boosting Pet Food E-commerce Displays",
    "description": "Many industry professionals have witnessed the internet go from a new frontier to an essential part of pet food sales and communications strategies for brands worldwide.",
    "date": "Mar, 2019",
    "image": "img/blogs/blog25.jpg",
    "url": "post-25.html"
  },
  {
    "title": "Pet Food a Casualty of The US-China Trade and Tariff War",
    "description": "Pet food plays an important role in the global economy – which means it’s also subject to overall economic factors, including those happening in international trade. Nowhere is this more evident than in the trade and tariff war between the U.S. and China that’s been raging, and escalating, since July 2018. The ongoing conflict, recently ratcheted up to even higher levels, is affecting pet food in terms of both exports and imports.",
    "date": "Feb, 2019",
    "image": "img/blogs/blog24.jpg",
    "url": "post-24.html"
  },
  {
    "title": "Consumer Demands are Shaping Natural Pet Food Categories",
    "description": "Beyond the traditional game of catch in the park, pet owners now want to share more of their outdoor adventures with their pets, especially dogs. People too pay more attention to the foods they eat to fuel their lifestyles and seek out ingredients that match their focus on health and well-being.",
    "date": "Feb, 2019",
    "image": "img/blogs/blog23.jpg",
    "url": "post-23.html"
  },
  {
    "title": "Taking a Page from Pet Supplements",
    "description": "Functional pet food and treats, as well as pet supplements, have their place in the pet market.",
    "date": "Jan, 2019",
    "image": "img/blogs/blog22.jpg",
    "url": "post-22.html"
  },
  {
    "title": "Pet Owners Most Want Plant-based Diet Nutrition Info",
    "description": "Globally, pet owners may tend to be vegetarians and vegans at higher rates than average, which has repercussions for their plant-based pet food purchasing preferences.",
    "date": "Jan, 2019",
    "image": "img/blogs/blog21.jpg",
    "url": "post-21.html"
  },
  {
    "title": "3 Superfoods Growing Fast as Cat Food Trends",
    "description": "Superfood ingredients in cat food.",
    "date": "Dec, 2018",
    "image": "img/blogs/blog20.jpg",
    "url": "post-20.html"
  },
  {
    "title": "New Product Opportunities Posed for Pet Treats",
    "description": "Pet treat opportunities based on ingredients, functional benefits.",
    "date": "Dec, 2018",
    "image": "img/blogs/blog19.jpg",
    "url": "post-19.html"
  },
  {
    "title": "Will More Pet Food Consumers Continue to Find Out The Meaning of 'Fresh'?",
    "description": "One definition for “fresh” that best applies to pet food is: “Not preserved, as by canning, smoking or freezing.” Yet as a market category, fresh pet food is still not well-defined, established or tracked.",
    "date": "Nov, 2018",
    "image": "img/blogs/blog18.jpg",
    "url": "post-18.html"
  },
  {
    "title": "PetsBuddy Pet Food in AusPet 2018 of Gold Coast",
    "description": "We are just back from the AusPet 2018 in Gold Coast. Our proud PetsBuddy Pet Food were loved and fully supported by Australian visitors and customers. These adorable pictures show how popular the PetsBuddy roo and dairy products are.",
    "date": "Nov, 2018",
    "image": "img/blogs/blog17-1.jpg",
    "url": "post-17.html"
  },
  {
    "title": "Cats and Dogs Respond Differently to Similar Raw Pet Food",
    "description": "The differences in cats and dogs digestive systems was exemplified in the way that their systems responded to similar raw, high-protein diets.",
    "date": "Oct, 2018",
    "image": "img/blogs/blog16.jpg",
    "url": "post-16.html"
  },
  {
    "title": "Functional Pet Food Ingredient is More Popular",
    "description": "Functional ingredients are now being used in all kinds of pet food formulations, as larger industry trends find answers in functional options.",
    "date": "Oct, 2018",
    "image": "img/blogs/blog15.jpg",
    "url": "post-15.html"
  },
  {
    "title": "Pet Food Brands Conquer Competitors in Search Engines",
    "description": "By bidding against competitors’ branded terms, pet food companies using conquesting aim to encourage customers to switch brands.",
    "date": "Sep, 2018",
    "image": "img/blogs/blog14-1.jpg",
    "url": "post-14.html"
  },
  {
    "title": "Human Food Trends Driving Pet Food Product Innovation",
    "description": "Natural pet food continuing to evolve.",
    "date": "Sep, 2018",
    "image": "img/blogs/blog13.jpg",
    "url": "post-13.html"
  },
  {
    "title": "The PetsBuddy in Pet Fair Asia 2018 in Shanghai",
    "description": "In the Pet Fair Asia 2018 that has just passed in the end of August, Australia Pet Industry Group with our business partners continued to display PetsBuddy™ products to Chinese customers.",
    "date": "Aug, 2018",
    "image": "img/blogs/blog12-1.jpg",
    "url": "post-12.html"
  },
  {
    "title": "Why a Pet Owner Chooses Your Pet Shop?",
    "description": "Pet owners in the Australian Market stated that convenience, price and brand selection dominated their reasons for choosing one pet product retailer over another.",
    "date": "Aug, 2018",
    "image": "img/blogs/blog11.jpg",
    "url": "post-11.html"
  },
  {
    "title": "Trump’s Metal Tariffs May Raise Costs for Canned Pet Food",
    "description": "US tariffs on steel and aluminum may raise costs for pet food companies and US consumers.",
    "date": "Jul, 2018",
    "image": "img/blogs/blog10.jpg",
    "url": "post-10.html"
  },
  {
    "title": "Research Shows That Long-term Raw Dog Food Diet Will Increase Gut Bacteria Levels",
    "description": "Dogs eating a homemade raw diet harbored a wider range of microorganisms, and larger populations of them.",
    "date": "Jul, 2018",
    "image": "img/blogs/blog9.jpg",
    "url": "post-9.html"
  },
  {
    "title": "We Are Just Back from CPFE 2018 in China",
    "description": "Australia Pet Industry Group continues to expand and prompt PetsBuddy™ products in Chinese market with our valuable business partners.",
    "date": "Jun, 2018",
    "image": "img/blogs/blog8-1.jpg",
    "url": "post-8.html"
  },
  {
    "title": "Dogs Likely Evolved to Eat Cooked Meat and Carbohydrates",
    "description": "According to Brian Hare, PhD, associate professor of evolutionary anthropology at Duke University and founder of Dognition, dog foods marketed as replicating wolves’ raw meat diets actually may satisfy human ...",
    "date": "Jun, 2018",
    "image": "img/blogs/blog7.jpg",
    "url": "post-7.html"
  },
  {
    "title": "Pet Food is Focusing on Alternative Ingredients—Dried Yeast is One Possible Answer",
    "description": "Two presentations at Petfood Forum 2018 highlighted the need for alternative pet food ingredient research.",
    "date": "May, 2018",
    "image": "img/blogs/blog6.jpg",
    "url": "post-6.html"
  },
  {
    "title": "PetsBuddy™ Pet Products Now Available in China in April 2018",
    "description": "Working with our best business partner—Beijing Margo Commercial & Trade Co., Australia Pet Industry Group launched PetsBuddy™ formulated pet dairy products and roo pet treats onto Chinese market through the 5th China Beijing International Pet Supplies Exhibition that has just passed in April...",
    "date": "May, 2018",
    "image": "img/blogs/blog5.jpg",
    "url": "post-5.html"
  },
  {
    "title": "The Important Role of Taurine in Cats Food",
    "description": "Amino acids are the “building blocks” of proteins. All animals require amino acids to maintain a healthy physiological function. Proteins are made up of groups of amino acids, around 10 of which cannot be produced by a cat's body and need to be supplied within the diet.",
    "date": "Apr, 2018",
    "image": "img/blogs/blog1.jpg",
    "url": "post-1.html"
  },
  {
    "title": "Research on Milk Products for Dog and Cat",
    "description": "Dog and cat milk have very different nutrient composition than normal cow's milk. Cow's milk is dilute (contains less solids per litre), and has a lower energy and protein content than both dog & cat milk. This is because cows are born well-developed (precocial), are slower growing and need less nutrients in their milk than puppies or kittens.",
    "date": "Mar, 2018",
    "image": "img/blogs/blog2.jpg",
    "url": "post-2.html"
  },
  {
    "title": "The Study on Benefits of Kangaroo Meat",
    "description": "Kangaroo meat is high in protein and low in fat (about 2%). Kangaroo meat has a very high concentration of conjugated linoleic acid (CLA) when compared with other foods. CLA has been attributed with a wide range of health benefits including anti-carcinogenic and anti-diabetes properties, in addition to reducing obesity and atherosclerosis.",
    "date": "Feb, 2018",
    "image": "img/blogs/blog3.jpg",
    "url": "post-3.html"
  },
  {
    "title": "The Role of High Protein in the Management of Obesity in Pets",
    "description": "An important goal in the management of obesity is to reduce excess body fat while minimizing the loss of lean tissue. The high protein diet resulted in a greater loss of body fat and greater retention of lean body mass compared with the control diet.",
    "date": "Jan, 2018",
    "image": "img/blogs/blog4.jpg",
    "url": "post-4.html"
  }
]
